### Core data structures

In [1]:
import pandas as pd

In [2]:
pd.Series([71, 84, 23,54,67,87])

0    71
1    84
2    23
3    54
4    67
5    87
dtype: int64

In [4]:
s1 = pd.Series([71, 84, 23,54,67,87], index=["a", "b", "c", "d", "e", "f"])

In [5]:
s1

a    71
b    84
c    23
d    54
e    67
f    87
dtype: int64

In [9]:
s1["a"]

np.int64(71)

In [11]:
d1 = pd.DataFrame({
    "name": ["a", "b", "c"],
    "age": [12, 13,14],
    "gender": ["M", "F", "F"]
})

In [12]:
d1

  name  age gender
0    a   12      M
1    b   13      F
2    c   14      F

In [13]:
s1.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [14]:
d1.index

RangeIndex(start=0, stop=3, step=1)

In [15]:
d1.columns

Index(['name', 'age', 'gender'], dtype='object')

### Creating data frames

In [17]:
data = [["harry" , 34], ["Jack", 67], ["James", 23]]

In [18]:
pd.DataFrame(data, columns=["Name", "Marks"])

    Name  Marks
0  harry     34
1   Jack     67
2  James     23

In [19]:
import numpy as np;

In [20]:
arr = np.array([[1, 2], [5, 6]])

In [21]:
df2 = pd.DataFrame(arr, columns=["value1" , " value2"])

In [22]:
df2

   value1   value2
0       1        2
1       5        6

In [28]:
excelData = pd.read_csv("pandas-1.csv")

In [29]:
excelData

      Name School  Marks
0  Shubham    ARR     76
1    Akash    SPS     12
2    Rishi    DPS     54
3    Ayush    LIX     23

In [32]:
df2 = pd.read_json("pandas-1.json")

In [33]:
df2

    name language school
0  Harry   Python    NaN
1  Rahul      C++    NaN
2    NaN      NaN    VPS

In [36]:
# df3 = pd.read_csv("url")

In [37]:
# head, tail, info, describe, columns, shape

### Data selection and filtering

In [38]:
df3 = pd.read_csv("pandas-2.csv")

In [39]:
df3

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [41]:
df3["Actor"][3]

'Ranbir Kapoor'

In [44]:
df3[["Actor","IMDb"]]

                 Actor  IMDb
0       Shah Rukh Khan   7.2
1          Salman Khan   6.0
2           Aamir Khan   8.4
3        Ranbir Kapoor   5.6
4        Ranveer Singh   7.0
5   Ayushmann Khurrana   8.3
6        Rajkummar Rao   7.5
7       Hrithik Roshan   6.5
8         Akshay Kumar   7.0
9        Kartik Aaryan   5.9
10        Varun Dhawan   6.1
11       Vicky Kaushal   8.2

In [45]:
df3.loc[1]

Actor                       Salman Khan
Film                    Tiger Zinda Hai
Year                               2017
Genre                            Action
BoxOffice(INR Crore)                565
IMDb                                6.0
Name: 1, dtype: object

In [47]:
df3.iloc[1]

Actor                       Salman Khan
Film                    Tiger Zinda Hai
Year                               2017
Genre                            Action
BoxOffice(INR Crore)                565
IMDb                                6.0
Name: 1, dtype: object

In [49]:
df3.loc[10,"Actor"]

'Varun Dhawan'

In [56]:
df3.loc[0:3, "Actor":"IMDb"]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6

In [57]:
df3.at[0, "Actor"]

'Shah Rukh Khan'

In [59]:
 df3[df3["IMDb"] > 6]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [62]:
df3[(df3["Year"] > 2020) & (df3["IMDb"] > 6)]

            Actor     Film  Year   Genre  BoxOffice(INR Crore)  IMDb
0  Shah Rukh Khan  Pathaan  2023  Action                  1050   7.2

In [64]:
df3.query("Year > 2019 and IMDb > 6")

            Actor     Film  Year   Genre  BoxOffice(INR Crore)  IMDb
0  Shah Rukh Khan  Pathaan  2023  Action                  1050   7.2

In [66]:
df3.query("Actor == 'Shah Rukh Khan'")

            Actor     Film  Year   Genre  BoxOffice(INR Crore)  IMDb
0  Shah Rukh Khan  Pathaan  2023  Action                  1050   7.2

In [67]:
name = "Salman Khan"

In [68]:
df3.query("Actor == @name")

         Actor             Film  Year   Genre  BoxOffice(INR Crore)  IMDb
1  Salman Khan  Tiger Zinda Hai  2017  Action                   565   6.0

In [70]:
df3.loc[0:3, "Actor":"IMDb"]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6

In [5]:
import pandas as pd

In [7]:
data = pd.read_csv("pandas-2.csv")

In [8]:
data

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [10]:
data["Actor"]

0         Shah Rukh Khan
1            Salman Khan
2             Aamir Khan
3          Ranbir Kapoor
4          Ranveer Singh
5     Ayushmann Khurrana
6          Rajkummar Rao
7         Hrithik Roshan
8           Akshay Kumar
9          Kartik Aaryan
10          Varun Dhawan
11         Vicky Kaushal
Name: Actor, dtype: object

In [11]:
data[["Actor", "IMDb"]]

                 Actor  IMDb
0       Shah Rukh Khan   7.2
1          Salman Khan   6.0
2           Aamir Khan   8.4
3        Ranbir Kapoor   5.6
4        Ranveer Singh   7.0
5   Ayushmann Khurrana   8.3
6        Rajkummar Rao   7.5
7       Hrithik Roshan   6.5
8         Akshay Kumar   7.0
9        Kartik Aaryan   5.9
10        Varun Dhawan   6.1
11       Vicky Kaushal   8.2

In [12]:
data["Actor"][2]

'Aamir Khan'

In [14]:
data.loc[1]

Actor                       Salman Khan
Film                    Tiger Zinda Hai
Year                               2017
Genre                            Action
BoxOffice(INR Crore)                565
IMDb                                6.0
Name: 1, dtype: object

In [15]:
data["Actor"]

0         Shah Rukh Khan
1            Salman Khan
2             Aamir Khan
3          Ranbir Kapoor
4          Ranveer Singh
5     Ayushmann Khurrana
6          Rajkummar Rao
7         Hrithik Roshan
8           Akshay Kumar
9          Kartik Aaryan
10          Varun Dhawan
11         Vicky Kaushal
Name: Actor, dtype: object

In [17]:
data[["Actor", "Film"]]

                 Actor                      Film
0       Shah Rukh Khan                   Pathaan
1          Salman Khan           Tiger Zinda Hai
2           Aamir Khan                    Dangal
3        Ranbir Kapoor                Brahmastra
4        Ranveer Singh                 Padmaavat
5   Ayushmann Khurrana                 Andhadhun
6        Rajkummar Rao                     Stree
7       Hrithik Roshan                       War
8         Akshay Kumar                Good Newwz
9        Kartik Aaryan         Bhool Bhulaiyaa 2
10        Varun Dhawan     Badrinath Ki Dulhania
11       Vicky Kaushal  Uri: The Surgical Strike

In [22]:
data.loc[0]["Actor"]

'Shah Rukh Khan'

In [24]:
data.loc[0, "Actor"]

'Shah Rukh Khan'

In [23]:
data[data["IMDb"] > 5]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [25]:
data.loc[2:6]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5

In [29]:
data.loc[2:6][["Film","Genre"]]

         Film          Genre
2      Dangal      Biography
3  Brahmastra        Fantasy
4   Padmaavat     Historical
5   Andhadhun       Thriller
6       Stree  Horror Comedy

In [31]:
data.iloc[0:2, 4:6]

   BoxOffice(INR Crore)  IMDb
0                  1050   7.2
1                   565   6.0

In [40]:
data[(data["IMDb"] > 6) | (data["Year"] > 2020)][["Year", "Film"]]

    Year                      Film
0   2023                   Pathaan
2   2016                    Dangal
3   2022                Brahmastra
4   2018                 Padmaavat
5   2018                 Andhadhun
6   2018                     Stree
7   2019                       War
8   2019                Good Newwz
9   2022         Bhool Bhulaiyaa 2
10  2017     Badrinath Ki Dulhania
11  2019  Uri: The Surgical Strike

# Data cleaning and preprocessing

In [41]:
data3 = pd.read_csv("pandas-3.csv")

In [42]:
data3

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [46]:
data3.isnull()

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False   True  False   False  False      False
2  False  False  False   False  False      False
3  False   True  False   False  False      False
4  False  False  False   False  False      False
5   True  False  False   False  False       True
6  False  False  False   False  False      False
7  False  False  False   False  False      False
8  False   True  False   False  False      False

In [47]:
data3[data3["Age"].isnull()]

      Name  Age   City Gender            Email   Join Date
1  Charlie  NaN  Delhi      M  charlie@example  20-07-2021
3  Charlie  NaN  Delhi      M  charlie@example  20-07-2021
8  Charlie  NaN  Delhi      M  charlie@example  20-07-2021

In [49]:
data3.isnull().sum()

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [52]:
data3["Age"]

0    25.0
1     NaN
2    30.0
3     NaN
4    22.0
5    28.0
6    25.0
7    25.0
8     NaN
Name: Age, dtype: float64

In [53]:
avg = data3["Age"].mean()
avg

np.float64(25.833333333333332)

In [54]:
data3["Age"].fillna(avg)

0    25.000000
1    25.833333
2    30.000000
3    25.833333
4    22.000000
5    28.000000
6    25.000000
7    25.000000
8    25.833333
Name: Age, dtype: float64

In [55]:
data3

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [56]:
data3.ffill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    David  28.0        Delhi      F     eve@domain.com  12-11-2019
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [59]:
data3.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [60]:
data3.drop_duplicates()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [61]:
data3

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [62]:
data3.duplicated(subset=["Name","Age"])

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [63]:
data3["Name"].str.lower()

0      alice
1    charlie
2        bob
3    charlie
4      david
5        NaN
6      alice
7      alice
8    charlie
Name: Name, dtype: object

In [65]:
data3["Status"] = data3["Age"].apply(lambda x: "Adult" if x > 18 else "Minor")

In [66]:
data3

      Name   Age         City Gender              Email   Join Date Status
0    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020  Adult
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor
4    David  22.0       Mumbai      M  david@example.com  12-11-2019  Adult
5      NaN  28.0        Delhi      F     eve@domain.com         NaN  Adult
6    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
7    Alice  25.0     New York      F  alice@example.com  01-05-2021  Adult
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021  Minor

In [67]:
data3["Gender"].apply(lambda x: "Male" if x == "M" else "Female")

0    Female
1      Male
2      Male
3      Male
4      Male
5    Female
6    Female
7    Female
8      Male
Name: Gender, dtype: object

# Data Transformation

In [69]:
data

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [71]:
data.sort_values("Year")

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
7,Hrithik Roshan,War,2019,Action,475,6.5
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2

In [73]:
data.sort_values("Year", ascending= False)

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
2,Aamir Khan,Dangal,2016,Biography,2024,8.4

In [75]:
data.sort_values(["Year", "IMDb"], ascending= False)

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
7,Hrithik Roshan,War,2019,Action,475,6.5
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4

In [76]:
data.reset_index()

,index,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,7,Hrithik Roshan,War,2019,Action,475,6.5
8,8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [77]:
data["Rank"] = data["IMDb"].rank()

In [86]:
data.sort_values("Rank", ascending=False)

AttributeError: 'list' object has no attribute 'sort_values'

In [82]:
data.columns

Index(['Actor', 'Film', 'Year', 'Genre', 'BoxOffice(INR Crore)', 'IMDb',
       'Rank'],
      dtype='object')

In [84]:
data = ["Year"] + [col for col in data.columns if col != 'Year']

In [85]:
data

['Year', 'Actor', 'Film', 'Genre', 'BoxOffice(INR Crore)', 'IMDb', 'Rank']

# Melt and Pivot

In [87]:
import pandas as pd
 
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}
 
df = pd.DataFrame(data)
 
# Display the DataFrame
print(df)

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [88]:
data

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Math': [85, 78, 92],
 'Science': [90, 82, 89],
 'English': [88, 85, 94]}

In [89]:
df

      Name  Math  Science  English
0    Alice    85       90       88
1      Bob    78       82       85
2  Charlie    92       89       94

In [102]:
newData = df.copy().melt(id_vars="Name", value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

In [103]:
newData

      Name  Subject  Score
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    Alice  Science     90
4      Bob  Science     82
5  Charlie  Science     89
6    Alice  English     88
7      Bob  English     85
8  Charlie  English     94

In [104]:
newData.pivot(index="Name", columns="Subject", values="Score")

Subject  English  Math  Science
Name
Alice         88    85       90
Bob           85    78       82
Charlie       94    92       89

# Aggregation aND GROUPING

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime([
        "2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10",
        "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"
    ])
})

In [6]:
df

  Department Team Gender  Salary  Age   JoinDate
0         HR    A      M      85   23 2020-01-10
1         HR    A      F      90   25 2020-02-15
2         IT    B      M      78   30 2021-03-20
3         IT    B      F      85   22 2021-04-10
4  Marketing    C      M      92   28 2020-05-30
5  Marketing    C      F      88   26 2020-06-25
6      Sales    D      M      75   21 2021-07-15
7      Sales    D      F      80   27 2021-08-01

In [7]:
df["Salary"].mean()

np.float64(84.125)

In [10]:
df.groupby("Department")["Salary"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary, dtype: float64

In [12]:
df.groupby("Department")["Salary"].sum()

Department
HR           175
IT           163
Marketing    180
Sales        155
Name: Salary, dtype: int64

In [13]:
df.groupby("Department")["Salary"].count()

Department
HR           2
IT           2
Marketing    2
Sales        2
Name: Salary, dtype: int64

In [14]:
df.groupby("Department")["Salary"].min()

Department
HR           85
IT           78
Marketing    88
Sales        75
Name: Salary, dtype: int64

In [15]:

df.groupby("Department")["Salary"].max()

Department
HR           90
IT           85
Marketing    92
Sales        80
Name: Salary, dtype: int64

In [17]:
df.groupby("Department")["Salary"].agg(["mean", "count", "max", "min", "sum"])

            mean  count  max  min  sum
Department
HR          87.5      2   90   85  175
IT          81.5      2   85   78  163
Marketing   90.0      2   92   88  180
Sales       77.5      2   80   75  155

In [22]:
df.groupby("Department")["Salary"].agg(Mean = "mean", Count="count")

            Mean  Count
Department
HR          87.5      2
IT          81.5      2
Marketing   90.0      2
Sales       77.5      2

In [23]:
df["TeamAvg"] = df.groupby("Team")["Salary"].transform("mean")

In [24]:
df

  Department Team Gender  Salary  Age   JoinDate  TeamAvg
0         HR    A      M      85   23 2020-01-10     87.5
1         HR    A      F      90   25 2020-02-15     87.5
2         IT    B      M      78   30 2021-03-20     81.5
3         IT    B      F      85   22 2021-04-10     81.5
4  Marketing    C      M      92   28 2020-05-30     90.0
5  Marketing    C      F      88   26 2020-06-25     90.0
6      Sales    D      M      75   21 2021-07-15     77.5
7      Sales    D      F      80   27 2021-08-01     77.5

In [27]:
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)

  Department Team Gender  Salary  Age   JoinDate  TeamAvg
0         HR    A      M      85   23 2020-01-10     87.5
1         HR    A      F      90   25 2020-02-15     87.5
2         IT    B      M      78   30 2021-03-20     81.5
3         IT    B      F      85   22 2021-04-10     81.5
4  Marketing    C      M      92   28 2020-05-30     90.0
5  Marketing    C      F      88   26 2020-06-25     90.0

In [28]:
df.groupby("Team").filter(lambda x: x["Salary"].mean() > 80)["Salary"]

0    85
1    90
2    78
3    85
4    92
5    88
Name: Salary, dtype: int64

# Merging and joining data

In [29]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})
 
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [36]:
pd.merge(employees, departments, on="DeptID")

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [37]:
pd.merge(employees, departments, on="DeptID", how="left")

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [38]:
pd.merge(employees, departments, on="DeptID", how="right")

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [39]:
pd.merge(employees, departments, on="DeptID", how="outer")

   EmpID     Name  DeptID     DeptName
0    1.0    Alice      10           HR
1    2.0      Bob      20  Engineering
2    3.0  Charlie      30          NaN
3    NaN      NaN      40    Marketing

In [40]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

pd.concat([df1, df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [43]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Emp_Name": ["Charlie", "David"], "ID": [1,2]})

pd.concat([df1, df2])

    Name Emp_Name   ID
0  Alice      NaN  NaN
1    Bob      NaN  NaN
0    NaN  Charlie  1.0
1    NaN    David  2.0

In [44]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

pd.concat([df1, df2], axis=1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [47]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"], "ID": [1,2]})

pd.concat([df1, df2], axis=1)

    Name     Name  ID
0  Alice  Charlie   1
1    Bob    David   2

# Working with CSVs

In [49]:
data = pd.read_csv("pandas-2.csv")

In [50]:
data

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
1,Salman Khan,Tiger Zinda Hai,2017,Action,565,6.0
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
3,Ranbir Kapoor,Brahmastra,2022,Fantasy,431,5.6
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
9,Kartik Aaryan,Bhool Bhulaiyaa 2,2022,Horror Comedy,266,5.9
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [51]:
data[data["IMDb"] > 6]

,Actor,Film,Year,Genre,BoxOffice(INR Crore),IMDb
0,Shah Rukh Khan,Pathaan,2023,Action,1050,7.2
2,Aamir Khan,Dangal,2016,Biography,2024,8.4
4,Ranveer Singh,Padmaavat,2018,Historical,585,7.0
5,Ayushmann Khurrana,Andhadhun,2018,Thriller,111,8.3
6,Rajkummar Rao,Stree,2018,Horror Comedy,180,7.5
7,Hrithik Roshan,War,2019,Action,475,6.5
8,Akshay Kumar,Good Newwz,2019,Comedy,318,7.0
10,Varun Dhawan,Badrinath Ki Dulhania,2017,Romantic Comedy,201,6.1
11,Vicky Kaushal,Uri: The Surgical Strike,2019,Action,342,8.2

In [53]:
data.to_csv("updatedcsv.csv",index=False )

In [54]:
data1 = [
    {
        "id":1,
    "name": "Jack",
    "address": {
    "city": "Delhi",
"zipcode": 111010
}
    },
    {
        "id": 2,
    "name": "John",
    "address": {
    "city": "UP",
"zipcode": 114353
}
    }
]

In [56]:
pd.json_normalize(data1)

   id  name address.city  address.zipcode
0   1  Jack        Delhi           111010
1   2  John           UP           114353

# Practise questions

#### Create a DataFrame from a Python dictionary containing students’ names, ages, and grades.

#### Print the first 5 rows.

#### Get the number of rows and columns.

In [1]:
import pandas as pd

In [3]:
data = pd.DataFrame({
    "names": ["Ram", "Shyam", "Raju", "Rakesh", "Ramesh", "Suresh"],
    "ages": [23,64,23,45,53,64],
    "grades":[99,45,87,34,56,23]
})

In [4]:
data.head()

    names  ages  grades
0     Ram    23      99
1   Shyam    64      45
2    Raju    23      87
3  Rakesh    45      34
4  Ramesh    53      56

In [5]:
data.shape

(6, 3)

In [10]:
row, col = data.shape
print(row, col)

6 3

#### Load a CSV file (e.g., data.csv) into a DataFrame.

Display the first 10 rows.

Show the column names and data types.

In [6]:
data1 = pd.read_csv("color_srgb.csv")

In [7]:
data1

       Name      HEX               RGB
0     White  #FFFFFF  rgb(100,100,100)
1    Silver  #C0C0C0     rgb(75,75,75)
2      Gray  #808080     rgb(50,50,50)
3     Black  #000000        rgb(0,0,0)
4       Red  #FF0000      rgb(100,0,0)
5    Maroon  #800000       rgb(50,0,0)
6    Yellow  #FFFF00    rgb(100,100,0)
7     Olive  #808000      rgb(50,50,0)
8      Lime  #00FF00      rgb(0,100,0)
9     Green  #008000       rgb(0,50,0)
10     Aqua  #00FFFF    rgb(0,100,100)
11     Teal  #008080      rgb(0,50,50)
12     Blue  #0000FF      rgb(0,0,100)
13     Navy  #000080       rgb(0,0,50)
14  Fuchsia  #FF00FF    rgb(100,0,100)
15   Purple  #800080      rgb(50,0,50)

In [8]:
data1[0:10]

     Name      HEX               RGB
0   White  #FFFFFF  rgb(100,100,100)
1  Silver  #C0C0C0     rgb(75,75,75)
2    Gray  #808080     rgb(50,50,50)
3   Black  #000000        rgb(0,0,0)
4     Red  #FF0000      rgb(100,0,0)
5  Maroon  #800000       rgb(50,0,0)
6  Yellow  #FFFF00    rgb(100,100,0)
7   Olive  #808000      rgb(50,50,0)
8    Lime  #00FF00      rgb(0,100,0)
9   Green  #008000       rgb(0,50,0)

In [9]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    16 non-null     object
 1   HEX     16 non-null     object
 2   RGB     16 non-null     object
dtypes: object(3)
memory usage: 516.0+ bytes

#### Given a DataFrame of sales data:

| Product | Price | Quantity |
|---------|-------|----------|
| Apple   | 2     | 5        |
| Orange  | 3     | 10       |
| Banana  | 1     | 8        |


Add a new column Total = Price * Quantity.

Find the average price.

In [12]:
data2 = pd.DataFrame({
    "Product": ["Apple", "Orange", "Banana"],
    "Price": [2,3,1],
    "Quantity": [5,10,8]
})
data2["Total"] = data2["Price"] * data2["Quantity"]
avg = data2["Price"].mean()
print(data2)
print(avg)

  Product  Price  Quantity  Total
0   Apple      2         5     10
1  Orange      3        10     30
2  Banana      1         8      8
2.0

#### Select only the rows where Quantity > 5.

In [13]:
data2[data2["Quantity"] > 5]

  Product  Price  Quantity  Total
1  Orange      3        10     30
2  Banana      1         8      8

In [15]:
data2.sort_values("Price", ascending=False)

  Product  Price  Quantity  Total
1  Orange      3        10     30
0   Apple      2         5     10
2  Banana      1         8      8

#### Load a dataset with missing values.

Find how many null values each column has.

Fill missing numeric values with the column mean.

In [17]:
import numpy as np
data_missing = pd.DataFrame({
    "Name": ["Ram", "Shyam", "Raju", "Rakesh", "Ramesh", "Suresh", "Amit", "Sumit"],
    "Age": [23, 64, np.nan, 45, 53, 64, 29, np.nan],
    "Grade": [99, 45, 87, np.nan, 56, 23, np.nan, 78],
    "City": ["Delhi", "Mumbai", "Delhi", np.nan, "Chennai", "Delhi", "Mumbai", np.nan]
})

In [18]:
data_missing

     Name   Age  Grade     City
0     Ram  23.0   99.0    Delhi
1   Shyam  64.0   45.0   Mumbai
2    Raju   NaN   87.0    Delhi
3  Rakesh  45.0    NaN      NaN
4  Ramesh  53.0   56.0  Chennai
5  Suresh  64.0   23.0    Delhi
6    Amit  29.0    NaN   Mumbai
7   Sumit   NaN   78.0      NaN

In [21]:
data_missing.isna().count()

Name     8
Age      8
Grade    8
City     8
dtype: int64

In [25]:
data_missing.isna().sum()
data3 = data_missing.copy()

In [24]:
data_missing.isna()

    Name    Age  Grade   City
0  False  False  False  False
1  False  False  False  False
2  False   True  False  False
3  False  False   True   True
4  False  False  False  False
5  False  False  False  False
6  False  False   True  False
7  False   True  False   True

In [31]:
data3
data3.fillna(data3.mean(numeric_only=True), inplace=True)

In [32]:
data3

     Name        Age      Grade     City
0     Ram  23.000000  99.000000    Delhi
1   Shyam  64.000000  45.000000   Mumbai
2    Raju  46.333333  87.000000    Delhi
3  Rakesh  45.000000  64.666667      NaN
4  Ramesh  53.000000  56.000000  Chennai
5  Suresh  64.000000  23.000000    Delhi
6    Amit  29.000000  64.666667   Mumbai
7   Sumit  46.333333  78.000000      NaN

#### Given a column "Date" with string format "YYYY-MM-DD",

Convert it to datetime.

Extract the year and month into separate columns.

In [33]:
data_dates = pd.DataFrame({
    "ID": [1, 2, 3, 4, 5, 6],
    "Name": ["Ram", "Shyam", "Raju", "Rakesh", "Ramesh", "Suresh"],
    "Date": ["2023-01-15", "2022-12-05", "2021-06-21", "2023-03-11", "2022-09-30", "2021-11-17"],
    "Sales": [2500, 1800, 3400, 2900, 3100, 2700]
})

In [34]:
data_dates

   ID    Name        Date  Sales
0   1     Ram  2023-01-15   2500
1   2   Shyam  2022-12-05   1800
2   3    Raju  2021-06-21   3400
3   4  Rakesh  2023-03-11   2900
4   5  Ramesh  2022-09-30   3100
5   6  Suresh  2021-11-17   2700

In [38]:
data_dates["Date"].astype("datetime64[ns]")

0   2023-01-15
1   2022-12-05
2   2021-06-21
3   2023-03-11
4   2022-09-30
5   2021-11-17
Name: Date, dtype: datetime64[ns]

In [44]:
data_dates["Date"] = pd.to_datetime(data_dates["Date"])

In [45]:
type(data_dates["Date"])

pandas.core.series.Series

In [46]:
data_dates["Year"] = data_dates["Date"].dt.year
data_dates["Month"] = data_dates["Date"].dt.month

In [47]:
data_dates

   ID    Name       Date  Sales  Year  Month
0   1     Ram 2023-01-15   2500  2023      1
1   2   Shyam 2022-12-05   1800  2022     12
2   3    Raju 2021-06-21   3400  2021      6
3   4  Rakesh 2023-03-11   2900  2023      3
4   5  Ramesh 2022-09-30   3100  2022      9
5   6  Suresh 2021-11-17   2700  2021     11

#### From a DataFrame of employees with columns: ["Name", "Department", "Salary"]:

Find the highest salary in each department.

Find the department with the lowest average salary.

In [48]:
employees = pd.DataFrame({
    "Name": ["Ram", "Shyam", "Raju", "Rakesh", "Ramesh", "Suresh", "Amit", "Sumit", "Neha", "Priya"],
    "Department": ["HR", "Finance", "IT", "IT", "Finance", "HR", "Sales", "Sales", "IT", "Finance"],
    "Salary": [50000, 75000, 60000, 85000, 72000, 55000, 65000, 62000, 90000, 70000]
})

In [49]:
employees

     Name Department  Salary
0     Ram         HR   50000
1   Shyam    Finance   75000
2    Raju         IT   60000
3  Rakesh         IT   85000
4  Ramesh    Finance   72000
5  Suresh         HR   55000
6    Amit      Sales   65000
7   Sumit      Sales   62000
8    Neha         IT   90000
9   Priya    Finance   70000

In [52]:
emp = employees.groupby("Department")["Salary"].max()

In [53]:
emp

Department
Finance    75000
HR         55000
IT         90000
Sales      65000
Name: Salary, dtype: int64

In [54]:
emp.min()

55000

In [57]:
em = employees.groupby("Department")["Salary"].mean()

In [58]:
em

Department
Finance    72333.333333
HR         52500.000000
IT         78333.333333
Sales      63500.000000
Name: Salary, dtype: float64

In [59]:
em.idxmin()

'HR'

In [60]:
em["HR"]

np.float64(52500.0)

In [61]:
em.min()

52500.0

#### Given a dataset of customer transactions:

Group by CustomerID and calculate total spend.

Find the top 5 customers by spend.

In [62]:
transactions = pd.DataFrame({
    "CustomerID": [101, 102, 103, 101, 104, 105, 102, 103, 101, 106, 104, 102],
    "Product": ["Laptop", "Phone", "Tablet", "Mouse", "Headphones", "Monitor", 
                "Keyboard", "Charger", "Laptop", "Phone", "Mouse", "Tablet"],
    "Quantity": [1, 2, 1, 3, 1, 2, 1, 2, 1, 1, 2, 1],
    "Price": [800, 600, 300, 20, 100, 200, 50, 25, 850, 700, 30, 350]
})

In [63]:
transactions

    CustomerID     Product  Quantity  Price
0          101      Laptop         1    800
1          102       Phone         2    600
2          103      Tablet         1    300
3          101       Mouse         3     20
4          104  Headphones         1    100
5          105     Monitor         2    200
6          102    Keyboard         1     50
7          103     Charger         2     25
8          101      Laptop         1    850
9          106       Phone         1    700
10         104       Mouse         2     30
11         102      Tablet         1    350

In [72]:
tr = transactions.groupby("CustomerID").sum()

In [73]:
 tr

                        Product  Quantity  Price
CustomerID
101           LaptopMouseLaptop         5   1670
102         PhoneKeyboardTablet         4   1000
103               TabletCharger         3    325
104             HeadphonesMouse         3    130
105                     Monitor         2    200
106                       Phone         1    700

In [76]:
sr = tr.sort_values("Price", ascending=False)

In [77]:
sr

                        Product  Quantity  Price
CustomerID
101           LaptopMouseLaptop         5   1670
102         PhoneKeyboardTablet         4   1000
106                       Phone         1    700
103               TabletCharger         3    325
105                     Monitor         2    200
104             HeadphonesMouse         3    130

In [78]:
sr.head()

                        Product  Quantity  Price
CustomerID
101           LaptopMouseLaptop         5   1670
102         PhoneKeyboardTablet         4   1000
106                       Phone         1    700
103               TabletCharger         3    325
105                     Monitor         2    200

#### Merge two DataFrames:

One with customer info (CustomerID, Name)

One with orders (CustomerID, OrderAmount)

Get a combined DataFrame showing each customer’s name and their total order amount.

In [79]:
customers = pd.DataFrame({
    "CustomerID": [101, 102, 103, 104, 105],
    "Name": ["Ram", "Shyam", "Raju", "Rakesh", "Neha"]
})

# Orders DataFrame
orders = pd.DataFrame({
    "CustomerID": [101, 102, 101, 104, 103, 105, 102, 101],
    "OrderAmount": [250, 300, 150, 400, 500, 200, 350, 100]
})

In [84]:
mr = pd.merge(customers, orders)

In [86]:
mr

   CustomerID    Name  OrderAmount
0         101     Ram          250
1         101     Ram          150
2         101     Ram          100
3         102   Shyam          300
4         102   Shyam          350
5         103    Raju          500
6         104  Rakesh          400
7         105    Neha          200

In [87]:
type(mr)

pandas.core.frame.DataFrame

In [88]:
mr["Name"]

0       Ram
1       Ram
2       Ram
3     Shyam
4     Shyam
5      Raju
6    Rakesh
7      Neha
Name: Name, dtype: object

In [90]:
mr[["Name", "OrderAmount"]]

     Name  OrderAmount
0     Ram          250
1     Ram          150
2     Ram          100
3   Shyam          300
4   Shyam          350
5    Raju          500
6  Rakesh          400
7    Neha          200